# Pandas Series From Python Object

In [46]:
import pandas as pd
import numpy as np

# Create Series -I

In [52]:
lst=[5,2,3,4]
a=pd.Series(lst)

In [53]:
a.values

array([5, 2, 3, 4], dtype=int64)

In [12]:
pd.Series([2,3,4,False,'i am suraj'])

0             2
1             3
2             4
3         False
4    i am suraj
dtype: object

In [14]:
dic={"suman":"Nepal Army",
     "sujan":"Brititsh Army",
    "suraj":"Computer Engineer",
     "Mom":"HouseWife",
     "Father":"Security Guard"
    }

In [15]:
dic

{'suman': 'Nepal Army',
 'sujan': 'Brititsh Army',
 'suraj': 'Computer Engineer',
 'Mom': 'HouseWife',
 'Father': 'Security Guard'}

In [16]:
pd.Series(dic)

suman            Nepal Army
sujan         Brititsh Army
suraj     Computer Engineer
Mom               HouseWife
Father       Security Guard
dtype: object

# Create Series-II

In [33]:
s=pd.read_csv("suraj.csv")

In [34]:
s

              Name  Age
0      Krishna Ale   53
1  Sanu Maya   Ale   44
2        Suman Ale   26
3      Sirjana Ale   23
4  Sujan Ale Magar   23
5  Suraj Ale Magar   21

In [27]:
type(s)

pandas.core.frame.DataFrame

r=pd.read_csv("suraj.csv",header=None,squeeze=True)

In [35]:
r

                 0    1
0             Name  Age
1      Krishna Ale   53
2  Sanu Maya   Ale   44
3        Suman Ale   26
4      Sirjana Ale   23
5  Sujan Ale Magar   23
6  Suraj Ale Magar   21

In [29]:
type(r)

pandas.core.frame.DataFrame

In [4]:
r=pd.read_csv("suraj.csv",header=None,squeeze=True)

In [32]:
r

                 0    1
0             Name  Age
1      Krishna Ale   53
2  Sanu Maya   Ale   44
3        Suman Ale   26
4      Sirjana Ale   23
5  Sujan Ale Magar   23
6  Suraj Ale Magar   21

In [40]:
a=pd.read_csv("RandomData.csv",header=None,squeeze=True)

In [41]:
a

0     34
1     23
2      2
3      3
4      2
5    322
6     34
7      2
Name: 0, dtype: int64

In [5]:
s=pd.read_csv("suraj.csv",usecols=['Name'],squeeze=True)

In [65]:
type(s)

pandas.core.series.Series

In [6]:
s

0        Krishna Ale
1    Sanu Maya   Ale
2          Suman Ale
3        Sirjana Ale
4    Sujan Ale Magar
5    Suraj Ale Magar
Name: Name, dtype: object

In [19]:
s=pd.read_csv("RandomData.csv",header=None,squeeze=True)

In [20]:
s

0     34
1     23
2      2
3    322
4      2
5    322
6     34
7      2
Name: 0, dtype: int64

In [21]:
max(s)

322

In [22]:
s.idxmax()

3

In [23]:
min(s)

2

In [24]:
s.idxmin()

2

In [25]:
s

0     34
1     23
2      2
3    322
4      2
5    322
6     34
7      2
Name: 0, dtype: int64

In [26]:
s.mean()

92.625

In [27]:
s.product()

22054001536

In [30]:
s.head(3)

0    34
1    23
2     2
Name: 0, dtype: int64

In [31]:
s.tail(2)

6    34
7     2
Name: 0, dtype: int64

In [32]:
s.std()

142.22008849465877

In [34]:
s.describe()

count      8.000000
mean      92.625000
std      142.220088
min        2.000000
25%        2.000000
50%       28.500000
75%      106.000000
max      322.000000
Name: 0, dtype: float64

In [35]:
print("suraj")

suraj

In [2]:
month=["jan","feb","mar","apr","may","jun"]
tem=[2,3,5,6,4,1]

In [36]:
s1=pd.Series(tem,month)

In [37]:
s1

jan    2
feb    3
mar    5
apr    6
may    4
jun    1
dtype: int64

In [16]:
s1[[1,2]]

mar    5
may    4
dtype: int64

In [21]:
s1[1:4]

mar    5
may    4
feb    3
dtype: int64

In [23]:
s1[[2,3]]

may    4
feb    3
dtype: int64

In [29]:
s1[['jan','feb']]

jan    2
feb    3
dtype: int64

In [30]:
s1.nunique()

6

In [31]:
s1.value_counts()

6    1
5    1
4    1
3    1
2    1
1    1
dtype: int64

In [32]:
 for i in s1:
        print(i)

6
5
4
3
2
1

In [38]:
s1

jan    2
feb    3
mar    5
apr    6
may    4
jun    1
dtype: int64

In [34]:
def add(x):
    return x+5

In [39]:
s1

jan    2
feb    3
mar    5
apr    6
may    4
jun    1
dtype: int64

In [40]:
s1.apply(add)

jan     7
feb     8
mar    10
apr    11
may     9
jun     6
dtype: int64

In [41]:
s1

jan    2
feb    3
mar    5
apr    6
may    4
jun    1
dtype: int64

In [43]:
mapobj={2:"suraj",3:"sujan",1:"suman",40:"aman"}

In [45]:
s1.map(mapobj)

jan    suraj
feb    sujan
mar      NaN
apr      NaN
may      NaN
jun    suman
dtype: object